app/controllers/items_controller.rb

  def create_item
    if session[:user_id] != nil
    @ao = AccountOwner.find(session[:user_id])
    puts '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'
    puts @ao
    @item = List.new
    @item.item = params[:item]
    @item.quantity = params[:quantity].to_i
    @item.user = User.find(session[:user_id])
    @item.account_owner = @ao
    else
      @user = User.find(session[:user2_id])
      @ao = AccountOwner.find(@user.account_owner.id)
      @item = List.new
      @item.item = params[:item]
      @int = params[:quantity]
      @item.quantity = @int.to_i
      @item.user = @user
      @item.account_owner = @ao
    end
    if @item.valid?
      @item.save
---
SELECT  "account_owners".* FROM "account_owners" WHERE "account_owners"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "lists" ("item", "quantity", "account_owner_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item", "Apples"], ["quantity", 2], ["account_owner_id", 1], ["user_id", 1], ["created_at", "2019-10-24 20:04:20.100396"], ["updated_at", "2019-10-24 20:04:20.100396"]]

  def destroy
    @item = List.find(params[:id])
    @item.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]

  def list
    if session[:user_id] == nil and session[:user2_id] == nil
      redirect_to '/home', alert: ['No, no, no']
    else
      if session[:user2_id] != nil
        @x = User.find(session[:user2_id])
        puts '###################################################'
        @items = List.all
        puts @items
        render 'list'
      else
        @x = AccountOwner.find(session[:user_id])
        @items = List.where(account_owner: @x)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "lists".* FROM "lists"
SELECT  "account_owners".* FROM "account_owners" WHERE "account_owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."account_owner_id" IN (SELECT "lists"."id" FROM "lists" WHERE "lists"."account_owner_id" = $1) AND "lists"."user_id" = 2  [["account_owner_id", 1]]
SELECT COUNT(*) FROM "lists" WHERE "lists"."account_owner_id" = 1

  def new_user
    if session[:user_id] == nil
      redirect_to '/'
    else
    @ao = AccountOwner.find(session[:user_id])
    @users = User.where(account_owner: @ao)
---
SELECT  "account_owners".* FROM "account_owners" WHERE "account_owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."account_owner_id" = 1