app/controllers/users_controller.rb

  def create_ao
    if params['ao']['password'] == params['ao']['confirm_password']
      @ao = AccountOwner.create ( user_params )
      @ao.user_level = 1
      if @ao.valid?
        @ao.save
        session[:user_id] = AccountOwner.last.id
---
INSERT INTO "account_owners" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "account_owners" SET "user_level" = $1, "updated_at" = $2 WHERE "account_owners"."id" = $3  [["user_level", 1], ["updated_at", "2019-10-23 20:42:57.180531"], ["id", 1]]
SELECT  "account_owners".* FROM "account_owners" ORDER BY "account_owners"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create_user
    if params['user']['password'] == params['user']['confirm_password']
      @user = User.create ( sub_user_params )
      @user.user_level = 2
      @ao = AccountOwner.find(session[:user_id])
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "user_level", "account_owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "account_owners".* FROM "account_owners" WHERE "account_owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def login
    @ao = AccountOwner.find_by_email(params['email_login'])
---
SELECT  "account_owners".* FROM "account_owners" WHERE "account_owners"."email" = $1 LIMIT $2  [["email", "adamdanielrice1@gmail.com"], ["LIMIT", 1]]

  def login_user
    @ao = User.find_by_email(params['email_login2'])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dog@dog.com"], ["LIMIT", 1]]

  def delete
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]